# Project Part 2

 # Follow the instructions in 17.2 to create a books database (see 17.2.1 and your ch17/sql folder).

In [1]:
cd C:\Users\garre\Desktop\NWMSU\Classes\DataAnalyticsFundementals\44-608\608-mod6\ch17\sql

C:\Users\garre\Desktop\NWMSU\Classes\DataAnalyticsFundementals\44-608\608-mod6\ch17\sql

# Begin a new IPython session. (see .py file for Ipython code work)

# Import the sqlite3 module and use the connect function to create a connection to your database.

In [2]:
import sqlite3

In [3]:
connection = sqlite3.connect('books.db')

# There are 3 tables: authors, author_ISBN, and titles.

# Import pandas as pd

In [4]:
import pandas as pd

# Use pd options.display to set the max_columns to 10

In [5]:
pd.options.display.max_columns = 10

# Use pd read_sql fuction to select everything (*) from the authors table, then the titles table, then the author_ISBN table.

In [7]:
pd.read_sql('SELECT * FROM authors', connection,
            index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [8]:
pd.read_sql('Select * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [9]:
pd.read_sql('Select * FROM author_ISBN', connection)

    id        isbn
0    1  0134289366
1    2  0134289366
2    5  0134289366
3    1  0135404673
4    2  0135404673
5    1  0132151006
6    2  0132151006
7    3  0132151006
8    1  0134743350
9    2  0134743350
10   1  0133976890
11   2  0133976890
12   1  0133406954
13   2  0133406954
14   3  0133406954
15   1  0134601548
16   2  0134601548
17   1  0136151574
18   2  0136151574
19   4  0136151574
20   1  0134448235
21   2  0134448235
22   1  0134444302
23   2  0134444302

# Execute the more specific select commands from Section 17.2.3 using the WHERE clause.

In [10]:
pd.read_sql("""SELECT title, edition
               FROM titles
               WHERE edition > '2'""", connection)

                              title  edition
0     Internet & WWW How to Program        5
1               Java How to Program       11
2                  C How to Program        8
3  Visual Basic 2012 How to Program        6
4          Visual C# How to Program        6
5                C++ How to Program       10
6            Android How to Program        3
7         Android 6 for Programmers        3

# Execute the commands from Section 17.2.4 using the ORDER BY clause to get results back that are sorted in a useful way.

In [11]:
pd.read_sql("""SELECT id, first, last
                FROM authors
                ORDER BY id, first""",
                connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [12]:
pd.read_sql("""SELECT id, first, last
                FROM authors
                ORDER BY id DESC, first ASC""",
                connection, index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

In [13]:
print('Garrett Kopp')

Garrett Kopp